{"_id":{"$oid":"5dae31707d6ba653eb8aca8b"},"is_remote":false,"job_type":0,"visa_sponsor":true,"salary_range":1,"is_published":true,"title":"iOS Software Engineer","company":"AccuLynx","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p>We are actively looking for a smart and passionate iOS Mobile Engineer to evolve our Mobile SaaS offering. This role requires someone who loves the craft of building great software and is passionate about the user experience. AccuLynx is developing the next generation of construction management tools for the mobile space. Construction management is an emerging market that allows us to be creative and inventive on a daily basis.<p>","requirement":"<ul><li>Experience in native iOS development (Swift).</li>\n<li>Experience in full-stack mobile development.</li>\n<li>Self-motivated and able to manage multiple tasks.</li>\n<li>Belief that performance is a feature.</li>\n</ul>","created_at":{"$date":"2019-10-21T23:07:09.003Z"},"location":"New York, NY"}
{"_id":{"$oid":"5dae31fc7d6ba653eb8aca8c"},"is_remote":false,"job_type":1,"visa_sponsor":false,"salary_range":2,"is_published":true,"title":"Software Engineer (Masters in Math)","company":"VetSourceUSA","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p>Job responsibilities include modification as well as development of new programs for probabilistic analysis of capacity investment decisions, production network throughput optimization, and demand forecast simulation. Development is carried out in collaboration with other team members (responsible for IU, database layer and deployment across the enterprise), coding is mostly done in C#, SQL and R.</p>\n<p>Hours are first shift (8-5) but flexible. Remote work location is acceptable as long as within driving distance to Peoria, IL (such as Chigaco, St. Louis, Urbana-Champaign) but co-location in Peoria is preferred. Min. 5 days a month are expected for in-person meetings in Peoria. Daily team meeting</p>","requirement":"<p>Masters degree in Mathematics required with exception of Theoretical Physics majors or other significant mathematics background which may also be considered. *Candidate MUST have a true mathematics background to be considered*</p>\n<p>Min. 2 years professional work experience required after completion of college/university degree. Professional C# and SQL coding capability and experience required. Experience with R coding highly preferred. Other languages - .NET and VB knowledge is a plus. Overall solid coding experience required. Differentiating factors: Experience developing mathematical models, degree of exposure to probability/statistics and at least 5 years of C# coding experience.</p>","location":"Peroria, IL","created_at":{"$date":"2019-10-21T23:07:09.003Z"}}
{"_id":{"$oid":"5dae34bc71492554c2c75591"},"is_remote":false,"job_type":0,"visa_sponsor":true,"salary_range":1,"is_published":true,"title":"QA TEST MANAGER","company":"Value Info Tech","location":"Phoenix, AZ","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p>10+ yrs. experience in Testing organization with 3+ yrs. experience as Scrum Master/Release Test Manager\nBanking domain background is must, Amex experience is preferred.\n5+ Hands on experience working on test planning, coordination and status reporting of projects from initiation to implementation\nExpertise in Developing and execution of project test plans with milestones and ensures that the scope and approach are fully understood by all stakeholders\nKnowledge to provide guidance and subject matter expertise to engineers on Automation, Testing and QA processes, assists in preparation of test strategies including test data and test environment\nExpertise in the review process of user story backlog and requirements specifications and provides recommendations Plans and defines testing approach\nHands on experience managing the definition, implementation, and integration of quality principles into the design and development of software and IT processes for the team\n5+ years’ experience in Design, monitoring, and analysis of testing quality metrics such as defect, defect counts, test results, and test status\nGood knowledge on automation tools like Selenium/UFT and should be able to determine the need, selection and implementation of Automation tools.\nMust have good knowledge on SDLC and QA process and should we well versed with agile testing reporting tools like Rally, JIRA, ALM, Clarity, Sharepoint, Confluence etc.\nMust have active CSM and Safe agilest certification</p>","requirement":"<p>Required Skills: TestManager, Agile, SCRUM, Selenium, Sharepoint, Test Data, Test Plans, Banking experience is preferred</p>","created_at":{"$date":"2019-10-21T23:07:09.003Z"}}
{"_id":{"$oid":"5dae350771492554c2c75592"},"is_remote":false,"job_type":0,"visa_sponsor":false,"salary_range":2,"is_published":true,"title":"Software Engineer (JavaScript / Web / Mobile)","company":"Pushpay","location":"Redmond, WA","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p>Do you live and breathe mobile, web or backend Javascript development? Do you love engineering fast and beautiful user experiences? Come and work with us if you want to be part of creating a best-of-breed product which helps users engage with their communities.</p>\n<p>On a daily basis, you will work on a distributed system, hosted in AWS and written in Node.js that drives mobile app creation, content management, and publishing pipelines for both iOS and Android apps. You will maintain and enhance a front-end web application written using React (with Redux/Flux) that facilitates end-user customization of app content and management of releases by staff. Last of all, you will work on implementing new features for our mobile app platform, writing Javascript in React Native, and occasionally Java, Swift, or Objective C for low level device integrations.</p>\n<p>We are looking for a Software Engineer with server-side JavaScript experience in Node, or someone with substantial experience working on a single-page-application of size. Bonus points if you've also been involved in writing back-end systems in another language. We are looking for someone who is comfortable writing asynchronous JS code using callbacks and/or promises, and who is interested in learning and working with new technologies.</p>","requirement":"<ul>\n<li>3+ years of software engineering experience</li>\n<li>Highly proficient in JavaScript</li>\n<li>Communication skills for a highly collaborative software development process</li>\n<li>Practical commercial experience with Node, React, or React Native</li>\n<li>Writing maintainable and testable JavaScript code</li>\n<li>A pragmatic approach to delivering modular, scalable code</li>\n<li>Be a happy, positive-minded and kind person</li>\n<li>Have a personal commitment to continuously learn and improve</li>\n<li>Ideally, you also have hands on experience building systems that run on Amazon Web Services</li>\n</ul>","created_at":{"$date":"2019-10-21T23:07:09.003Z"}}
{"_id":{"$oid":"5dae355571492554c2c75593"},"is_remote":false,"job_type":0,"visa_sponsor":true,"salary_range":2,"is_published":true,"title":"Sr. Software Engineer/Team Lead","company":"Finzly","location":"Charlotte, NC","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p>Finzly's Sr Software Engineering / Team Lead role reports to the CTO and requires skill in developing modern microservice web applications and restful APIs on Amazon's AWS cloud platform. The role will lead a small team of onshore and offshore engineers to create innovative solutions for our banking customers. This is a hands on software engineering role for those that love innovation, the latest technology, and always eager to learn.</p>\n<ul><li>Design and implementation of APIs using the OpenAPI3 specification</li><li>Design and implementation of cloud based web experiences</li><li>Strong verbal and written communication skills required to educate team members on designs</li><li>Ability to create UML sequence diagrams to support complex microservice interactions</li><li>Solve complex software engineering problems using innovative solutions</li><li>Research the latest design patterns and implementations on Amazon AWS</li><li>Propose technical innovations to solve complex business problems</li><li>Implement and maintain a code quality program using SonarQube</li><li>Implement and maintain a test driven development approach</li></ul>","requirement":"<ul><li>Angular web development using JavaScript and TypeScript</li><li>Java 8 and Spring based application development</li><li>HTML, CSS, and JavaScript</li><li>Domain Driven Design for OpenAPI implementations</li><li>AWS EC2, S3, and ECS</li><li>Single Sign On implementation and modification</li><li>MySQL and Amazon RDS</li><li>MongoDB</li><li>ANSI SQL and Stored Procedures</li><li>Automated testing frameworks such as Selenium, Cucumber, and others</li><li>Spring Cloud Config for property management</li></ul>","created_at":{"$date":"2019-10-21T23:07:09.003Z"}}
{"_id":{"$oid":"5dae359d71492554c2c75594"},"is_remote":false,"job_type":0,"visa_sponsor":true,"salary_range":3,"is_published":true,"title":"Software/Hardware Integration Engineer","company":"ImageXpert, Inc","location":"Nashua, NH","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<ul><li>Integrate world-class machine vision products, including cameras, linear stages, lighting sources, lasers, and more.</li><li>Develop software-hardware interfaces, and customer-specific applications, using ImageXpert’s proprietary software on Mac OS.</li><li>Have strong interest and experience in machine vision, image processing, and automation.</li><li>Combine strong mathematics, physics, and other analytical skills with understanding of low-level and high-level programming.</li></ul>\n<ul><li>Use electrical and mechanical tools to assemble and test the systems.</li><li>Use strong communication skills to work with multidisciplinary teams of coworkers, customers, and suppliers</li><li>Have the unique opportunity to be involved with all aspects of business, from design, to production, to sales and marketing, to delivery and support.</li><li>Are self-starters, with the ability to work both with and without supervision.</li><li>Are flexible, willing and able to work on a variety of tasks.</li></ul>","requirement":"<ul><li>Bachelor’s degree or higher in mathematics, physics, computer science, electrical, mechanical, or related engineering area required.</li><li>At least three years professional experience required, including experience interfacing with hardware.</li><li>Strong skills in languages such as Matlab, C, C++, Pascal.</li><li>Experience working with vision and image processing a plus.</li></ul>","created_at":{"$date":"2019-10-21T23:07:09.003Z"}}
{"_id":{"$oid":"5dae35ea71492554c2c75595"},"is_remote":false,"job_type":0,"visa_sponsor":true,"salary_range":3,"is_published":true,"title":"Software Engineer, Backend","company":"Shape (ShapeScale)","location":"San Francisco, CA","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<ul>\n<li>Develop the communication layer between ShapeScale and the Cloud processing infrastructure</li>\n<li>Design and implement authentication and authorization for internal and external facing services</li>\n<li>Design and implement APIs to support both external platform users, as well as internal cross service applications.</li>\n<li>Ensure system security externally to protect against a variety of web-based attacks, as well as internally to guard against unintentional data access</li>\n<li>Ensure collaboration with senior management to help generate task breakdowns, and accurate schedules</li>\n<li>Participate in code reviews, architectural decision, write unit tests, and conduct troubleshooting to ensure up-time for live systems</li>\n<li>Work closely with front-end, backend, computer vision / machine learning and firmware engineers across the organization to define product requirements, schedules and specifications</li>\n</ul>","requirement":"<ul>\n<li>3+ years of experience in building scalable distributed systems from the ground up</li>\n<li>Strong Software Engineering skills with common languages like Python, Golang, or Ruby</li>\n<li>Demonstrable skills in having designed and deployed a scalable environment using 3rd party cloud services (AWS, Google Cloud, MS Azure, etc.)</li>\n<li>Experienced with streaming data processing using facilities like AWS Kinesis, Apache Kafka or similar</li>\n</ul>","created_at":{"$date":"2019-10-21T23:07:09.003Z"}}
{"_id":{"$oid":"5dae362671492554c2c75596"},"is_remote":false,"job_type":0,"visa_sponsor":true,"salary_range":2,"is_published":true,"title":"Software Engineer - Full-Stack, IXL Business Platform","company":"IXL Learning","location":"San Mateo, CA","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p>As a Full-Stack Software Engineer, you will build the back-end wiring, application logic, and UI that drive the site. You will find and use the best technologies to add features to our products, as well as to create new products. You'll be involved in all aspects of the development process and contribute to the entire code base – including design, coding, testing, debugging, and tuning. In addition to working with your fellow engineers, you'll collaborate with other teams to design amazing products that meet the needs of our users, who are students and teachers all over the world.</p>","requirement":"<ul>\n<li>1+ years of experience in software engineering</li>\n<li>Bachelor's or advanced degree in computer science or a related discipline</li>\n<li>A solid grasp of general programming principles</li>\n<li>Excellent programming skills in Java or other object-oriented language</li>\n<li>Ability to work both independently and with a wide variety of teams</li>\n<li>Knowledge of Unix, Java, SQL, JavaScript, CSS, or source control is a plus</li>\n<li>Passion for improving education through technology</li>\n</ul>","created_at":{"$date":"2019-10-21T23:07:09.003Z"}}
{"_id":{"$oid":"5dae365271492554c2c75597"},"is_remote":false,"job_type":0,"visa_sponsor":true,"salary_range":2,"is_published":true,"title":"Software Engineer, Release","company":"IXL Learning","location":"San Mateo, CA","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<ul>\n<li>Manage the technical design, engineering from coding to QA, and deployment for our IXL's products.</li>\n<li>Build automated release pipelines that package, test and deploy code</li>\n<li>Improve and adapt our release processes to changing business needs</li>\n<li>Own the source control system, third-party repositories, build system, and release data system</li>\n<li>Work cross functionally with our Engineering, Product Management, QA, and Design teams to maintain and communicate a clear release schedule and ensure successful deployments</li>\n</ul>","requirement":"<ul>\n<li>Bachelor's or advanced degree in computer science or a related discipline</li>\n<li>2+ years of experience in software engineering</li>\n<li>Knowledge of Release Management</li>\n<li>Excellent programming skills</li>\n<li>Strong analytical-reasoning and problem-solving skills</li>\n<li>Ability to work both independently and with a wide variety of teams</li>\n<li>Passion for improving education through technology</li>\n</ul>","created_at":{"$date":"2019-10-21T23:07:09.003Z"}}
{"_id":{"$oid":"5dae368771492554c2c75598"},"is_remote":false,"job_type":0,"visa_sponsor":true,"salary_range":2,"is_published":true,"title":"Full Stack Software Developer (Python/Javascript)","company":"SpotOn","location":"Stuart, FL","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p>As part of the business operations team, you would be working on various types of systems - from building APIs for exchanging data with external partners, to building web applications to manage business processes, to building out the infrastructure that is necessary to run those systems in a scalable and reliable way. We are looking for someone with at least 3 years of experience building technology solutions that have been used to solve real-world problems.</p>","requirement":"<ul><li>You’ve seen a few projects through to completion in similar roles, and either has worked or are comfortable working with, teams of small to medium size. For most folks, this means about 3+ years of industry experience.</li><li>You've worked with frontend development to some extent. JavaScript land moves fast, so we'll understand if your background doesn't perfectly align with our stack (Riot/React+Redux+Babel+Webpack, Backbone.js), but we're definitely looking for someone who's used a modern framework of some sort, and isn't strictly a jQuery wizard.</li><li>You've worked with some kind of MVC framework.</li><li>Have an eye for idiomatic, readable, and performant JS/Python (ES6+) code, and experience with linters/debuggers/profilers/etc. which help reach these goals</li><li>Comfortable with at least intermediate-level queries in MongoDB and/or PostgreSQL. We’ll gladly teach one or the other if needed, but knowledge of at least one is a must.</li><li>Understand Git and comfortable using a branch+tag workflow model that leans heavily on GitHub’s Pull Request utilities</li><li>Bonus: Have experience with JavaScript at or after the ES6 turning point. Trust us, it's a whole new world when you're able to use `import` and `async/await`. We're of course open to teaching these new features as needed.</li><li>Bonus: Have experience with Django, Flask, or AioHTTP.</li><li>Bonus: Have experience with both Python 2 and Python 3, and can explain some of the footguns involved in moving between these versions, and in writing cross-compatible code</li><li>Bonus: DevOps experience of any form. We’re Vagrant people locally and AWS people in the cloud. Experience with Ansible or similar configuration systems would be extra bonus points.</li><li>Bonus: You’re opinionated about tooling, process, code/test styles, etc., but not too snobby about it. Our process is flexible and ever-changing, and you’d be welcome to leave your mark on it!</li></ul>","created_at":{"$date":"2019-10-21T23:07:09.003Z"}}
{"_id":{"$oid":"5dae36d171492554c2c75599"},"is_remote":false,"job_type":0,"visa_sponsor":true,"salary_range":2,"is_published":true,"title":"Software Engineer","company":"Elder Research Inc","location":"Arlington, VA","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p>As a Software Engineer of Elder Research, you will join a functional team of accomplished Data Scientists, Software Engineers, and Data Engineers that deliver custom analytic solutions. Some of your responsibilities will include: iterative development of both web and desktop analytics platforms, consulting with internal and external clients to design application features, solution deployment, and assisting data scientists with programming best practices.</p>","requirement":"<ul><li>Bachelors or Master’s degree in Computer Science or related field or equivalent experience in a working role.</li>\n<li>2+ years of experience programming with Java (or equivalent, e.g. C#)</li>\n<li>2+ years of experience programming JavaScript or using a JavaScript framework such as React, Angular, Meteor, or Node.js.</li>\n<li>2+ years of experience programming Python, especially using web frameworks such as Flask or Django.</li>\n<li>Excellent written and verbal communication skills</li><br>\n</ul>","created_at":{"$date":"2019-10-21T23:07:09.003Z"}}
{"_id":{"$oid":"5dae370771492554c2c7559a"},"is_remote":false,"job_type":0,"visa_sponsor":true,"salary_range":2,"is_published":true,"title":"Python/Devops Developer","company":"Caldus","location":"Dallas, TX","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p>An innovative, established cloud based company, based out of San Jose is looking to hire Python/Devops Engineer for an urgent ongoing product development project.</p>","requirement":"<p>Required Skills:<br>- Strong experience with <b>Python</b> and <b>Bash/Shell scripting</b><br>- Experience and understanding of DevOps and test automation and tools (<b>Jenkins, testing frameworks, app deployment</b>) is a plus<br>- Understanding of public cloud environment / APIs is a plus<br>- Quick learners with good communication skills</p>","created_at":{"$date":"2019-10-21T23:07:09.003Z"}}
{"_id":{"$oid":"5dae374f71492554c2c7559b"},"is_remote":false,"job_type":0,"visa_sponsor":true,"salary_range":2,"is_published":true,"title":"Software Engineer - JavaScript, HTML","company":"eXcell","location":"Wauwatosa, WI","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p>Deliver hands-on development of web-based applications, platforms, and web services\nFollow coding guidelines and develop reusable libraries and services\nLearn to build software that is built to scale with anticipated user loads\nAdopt key industry trends that materially improve team performance and code quality\nWork effectively with cross-functional team members, and understand the role between software engineers, quality engineers, designers, program and project managers\nHelp engage a transformation in development operations and collaborate within your team to improve the time to market of software solutions your team builds</p>","requirement":"Having / pursuing a Bachelor's Degree or equivalent experience in software engineering or related field\nExposure to building websites with modern tools and technologies\nStrong ability to present and communicate own ideas\nStrong written and verbal communication skills\nOO design and coding skills\nExperience with JavaScript (browser), HTML / CSS, and at least one server-side language (PHP, Go, JavaScript (Node), etc.)\nFamiliarity with HTTP","created_at":{"$date":"2019-10-21T23:07:09.003Z"}}
{"_id":{"$oid":"5dae379671492554c2c7559c"},"is_remote":false,"job_type":0,"visa_sponsor":true,"salary_range":2,"is_published":true,"title":"Web Developer - 280537","company":"Procom","location":"Irving, TX","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<ul><li>Define needs around maintainability, testability, performance, security, quality and usability for UI platform</li>\n<li>Drive implementation, consistent patterns, reusable components, and coding standards of UI infrastructure to support multiple SPA applications driven by a common platform</li>\n<li>Enable agile development of UI artifacts</li>\n<li>Design, develop, and manage automated unit, integration and acceptance tests for all UI components</li>\n<li>Development of robust “seed” projects to serve as foundations for building similar web applications</li>\n<li>Work with the Business Analysts and Customers throughout the requirements process to properly understand the long-term goals of the program and where they fit in the overall UI infrastructure</li>\n<li>Communication of new technologies, best practices, etc. to developers, testers, and managers.</li>\n<li>Influence UI design requirements to build best-in-class experiences</li>\n<li>Mentoring and peer review of designs and coded implementations</li>\n<li>Work with technical specialists (Security Team, Performance Engineer, etc.) to ensure that all parties understand the system that is being designed and built and that all major issues are understood and mitigated.</li>\n<li>Expected to participate in several implementation phases of product development cycle – design, scoping, planning, implementation and test.</li>\n<li>Ensure the performance quality and responsiveness of applications.</li>\n<li>Investigate issues reported by testing teams to determine impact, root cause, and solve them.</li>\n<li>Identify and correct bottlenecks and fix bugs to optimize performance.</li>\n<li>Work in a fast-paced environment that fosters growth and learning.</li>\n<li>Verbal and written communication is clear and concise.</li>\n<li>Clearly articulate development and timeline dependencies.</li>\n<li>Improve team development related processes that accelerate delivery, drive innovation, lower costs, and improve quality.\n</li><li>Ensure self and peers are actively seeking ways to objectively measure productivity. (i.e., SonarQube Findbugs). This will include a focus on automating code quality, code performance, unit testing, and build processing in the CI/CD pipeline (RTC, Jenkins, RLM)\n</li></ul>","requirement":"<ul><li>BS/BA degree or equivalent combination of education/experience.</li>\n<li>Intermediate to senior level experience in an Apps Development role. Demonstrated strong execution capabilities</li>\n<li>6+ years’ experience in front end software development.</li>\n<li>Deep understanding of UI technologies and techniques that includes but not limited Angular, Redux, NGRX, RXJS, JavaScript, JAVA, WebSphere, Tomcat, JSON, HTML5, CSS and Web Services.</li>\n<li>Strong knowledge of Angular 5 including understanding of internal details of Angular and its event system.</li>\n<li>Experience with angular material.</li>\n<li>Experience with angular-cli and its configuration.</li>\n<li>Knowledge of front-end patterns (container/presenter, etc.)</li>\n<li>Experience in testing (Jasmine, Karma, protractor)</li>\n<li>Expert knowledge of browser behavior and compatibility, cross-browser issues and solutions, and coding for search engine optimization</li>\n<li>Demonstrated experience with Application Servers (Tomcat, WebSphere, Jetty, JBoss) and Web Servers (Apache, Nginx</li>\n</ul>","created_at":{"$date":"2019-10-21T23:07:09.003Z"}}
{"_id":{"$oid":"5dae37c471492554c2c7559d"},"is_remote":false,"job_type":0,"visa_sponsor":false,"salary_range":2,"is_published":true,"title":"Java,J2EE and SQL Developer","company":"Tekizma","location":"Herndon, VA","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p>Work authorization: H1b Opt Citizens Permanent residents</p>","requirement":"<ul><li>Understand business/product requirements and functional specification.</li><li>Able to coordinate with various globally located stakeholder teams.</li><li>Ability to work independently.</li><li>Bachelor's degree in computer science or equivalent.</li><li>Minimum 3 years of Software Development experience in J2EE technology.</li><li>Experience working on software Product(s) as a Senior Software engineer.</li><li>Must have experience with jQuery, JSP, Servlet &amp; Core Java.</li><li>Must have a good experience in Framework as Spring (MVC/IOC/AOP) and ORM as Hibernate.</li><li>Should have good experience in database with Oracle.</li><li>Knowledge on Web Services (SOAP), Rule Engine &amp; security will be an added advantage.</li><li>Should have good communications skills.</li><li>Should have a good problem-solving attitude.</li></ul>","created_at":{"$date":"2019-10-21T23:07:09.003Z"}}
{"_id":{"$oid":"5dae382b71492554c2c7559e"},"is_remote":false,"job_type":0,"visa_sponsor":true,"salary_range":3,"is_published":true,"title":"Senior Software Engineer","company":"Han-Tek Inc.","location":"Honeoye Falls, NY","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<ul><li>Leads the engineering team through concepting, design, programming, testing, and commissioning efforts</li><li>Develops design documentation, aligned and traceable with project contractual requirements</li><li>Interfaces with customer engineering and end-user contacts during project design and implementation cycle</li><li>Develops software control and execution programs and applications to manage manufacturing processes in a near real-time environment</li><li>Develops Factory Acceptance Test and Site Commissioning testing plans</li><li>Actively participates in off-line testing of software / hardware interfaces</li><li>Travels to site to support field efforts (20-35% travel required)</li></ul>","requirement":"<ul><li>10 years’ experience in software design and development</li><li>BS in Computer Science or equivalent experience</li><li>Strong knowledge of Python along with application and relational mapper frameworks</li><li>Strong knowledge of Linux Operating systems and operations</li><li>SQL Database setup and programming, such as MS SQL Server, PostgreSQL, and SQLite</li><li>Proficiency in version control tools such as Git and Jira</li><li>Familiarity with Java</li><li>Familiarity with PLC communication interfaces for Siemens and Allen-Bradley platforms</li><li>Familiarity with Inductive Automation Ignition HMI Development</li></ul>","created_at":{"$date":"2019-10-21T23:07:09.003Z"}}
{"_id":{"$oid":"5dae719bf58f7d5c0b0544a1"},"is_remote":true,"job_type":1,"visa_sponsor":false,"salary_range":2,"is_published":true,"created_at":{"$date":"2019-10-22T03:00:49.817Z"},"title":"Software Application Support Developer","company":"Sealaska","location":"Virtual, USA","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p>Technical Responsibilities</p>\n<ul>\n<li>Front-end and mid-tier focus along with server-side development in combination of new builds and legacy applications</li>\n<li>Develop application requiring knowledge of JavaScript and related libraries (React, Angular, etc.), and use of Node.js and relevant managers</li>\n<li>Perform server-side development using, .Net, .Net Core</li>\n<li>Utilize ORMs such as Entity Framework (code-first),</li>\n<li>Utilize relational databases (SQL Server, Oracle, etc.) on back-end</li>\n<li>Implement user interfaces using good usability and user experience practices</li>\n</ul>\n<p>Task Responsibilities</p>\n<ul>\n<li>Troubleshoot system performance and resolving complex technology issues</li>\n<li>Implement technical improvements, knowledge, and process improvements through trend and root cause analysis</li>\n<li>Manage application availability, reliability, serviceability and maintainability</li>\n<li>Ensure compliance to audit and security standards and guidelines</li>\n<li>Review documentation for accuracy and completeness, and updating documentation for any needed changes, additions or deletions.</li>\n<li>Participate in requirements definition to ensure development team has all necessary information</li>\n<li>Participate in an Agile project team (and help provide input on planning)</li>\n<li>Support multiple project/client needs as needed to stay aware of team needs, upcoming schedules, long-term support and new build processes in support of our federal, state government and commercial clients</li>\n<li>Suggest and explore new tools to improve processes</li>\n</ul>","requirement":"<p>Technical Qualifications</p>\n<ul>\n<li>Expertise working with JavaScript, HTML5, CSS</li>\n<li>Experience working in an Agile Environment</li>\n<li>3 to 5 years in software development/software maintenance with focus on front-end development with mix of mid-tier applications</li>\n<li>Experience using C#, ASP.Net within MVC framework, Entity Framework</li>\n<li>Working knowledge of version control and Continuous Integration within (Git, TFS, Jenkins).</li>\n<li>Implement provided UX designs</li>\n</ul>\n<p><strong>Other Qualifications</strong></p>\n<ul>\n<li>Must work well in a collaborative team environment and be flexible as workloads and priorities change</li>\n<li>Must be self-aware, motivated, and capable of working remotely, able to define and solve problems</li>\n<li>Must excel at communication, both face-to-face and electronic</li>\n<li>Should have a growth mindset to approach new technologies and new customer needs</li>\n<li>Bachelor’s Degree in Computer Science or related field preferred</li>\n</ul>"}
{"_id":{"$oid":"5daf3a4c715c8d7898fbde0f"},"is_remote":false,"job_type":0,"visa_sponsor":false,"salary_range":3,"is_published":true,"created_at":{"$date":"2019-10-22T17:10:38.088Z"},"title":"Software Backend Engineer","company":"AllyO","location":"Austin, TX","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p><b>THE POSITION</b></p>&#10;<ul><li>Collaborate daily with product, internal stakeholders, and other engineers to design and build chatbot systems</li><li>Owning major parts of the system, designing and delivering quality stable solutions</li><li>Working independently to tackle difficult problems and implement timely solutions</li><li>Communicating effectively within and across teams during design discussions</li><li>Work with QA, frontend engineers<font face=\"Helvetica Neue\">.</font></li><li><font face=\"Helvetica Neue\">Reports your daily tasks to direct managers.</font></li></ul>","requirement":"<p><b>YOUR BACKGROUND</b></p>\n<ul><li>Backend engineering experience, ideally building products from ideation to launch on a strong engineering team.</li><li>B.S. in Computer Science or a related field (M.S. a plus)</li><li>Strong programming skills in Python</li><li>Strong understanding of modern back-end service Python ecosystem frameworks: Django, Celery , Docker, Redis, Flusk</li><li>Experience with ORM , SQL database, MySQL, Postgres</li><li>APIs: REST/JSON</li><li>Experience with AWS, Docker</li><li>A pragmatic approach to engineering. Remove technical roadblocks by identifying areas of complexity and suggesting architectural improvements that increase performance and lower risk.</li><li>Excellent technical, written, and verbal interpersonal communication skills.</li></ul>"}
{"_id":{"$oid":"5daf4b42715c8d7898fbde10"},"is_remote":false,"job_type":0,"visa_sponsor":true,"salary_range":4,"is_published":true,"created_at":{"$date":"2019-10-22T17:10:38.088Z"},"title":"Senior Software Engineer","company":"Uptime Solutions","location":"Austin, TX","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p><b>Description:&#160;</b>Uptime Solutions (www.uptime-solutions.us) is a privately funded and fast-growing company based in Hanover, NH and Austin, TX. We are focused on developing wireless products for machinery management. The company offers a full range of machinery health and diagnostic tools, including a software application consisting of both real-time and historical features that provide a flexible and scalable solution to vibration monitoring analysis.</p><p>Uptime Solutions is looking for a strong software developer to build upon and maintain our current infrastructure. In this role you will work with C# and Python developers as well as data scientists to identify needed functionality for our web application and data analysis tools.</p><p>In addition to a flexible schedule, full benefits package, PTO and a competitive salary you will benefit from a unique growth opportunity with diverse responsibilities. If you are looking for an interesting and challenging environment to develop cutting-edge technologies, then you should apply!</p>","requirement":"<p><b>Required Qualifications:</b></p><ul><li>Must have a BA/BE, MS or PhD in engineering or computer science (or related)</li><li>Solid understanding of object-oriented programming concepts</li><li>Fluent in Python and C# or Java</li><li>Experience implementing machine learning modules</li><li>Experience with API development</li><li>Knowledge of relational databases</li><li>Excellent analytical skills, work ethic and communication</li></ul><p><b>Nice-to-haves</b>:</p><ul><li>Experience with Python Flask framework</li><li>Experience with big data</li><li>Experience with cloud-based computing</li><li>Familiarity with time-series and frequency analysis</li></ul>"}
{"_id":{"$oid":"5daf4b98715c8d7898fbde11"},"is_remote":false,"job_type":0,"visa_sponsor":false,"salary_range":3,"is_published":true,"created_at":{"$date":"2019-10-22T17:10:38.088Z"},"title":"Software QA Test Engineer","company":"HomeServices of America","location":"Austin, TX","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p>HomeServices of America/Merlin Labs, a Berkshire Hathaway affiliate, is growing! We are building out our QA team. In this role, you'll be an early hire on a team making a real impact.</p><p>We are seeking a mid-level Software QA &amp; Test Engineer to join our QA team.</p><p>As QA &amp; Test Engineer, you will set up rigorous methods to investigate root causes of system problems and assist our engineers and developers to debug and validate solutions. You will also set up QA procedures to verify new software before release.</p><p>We need a QA team member responsible for the planning, creation, and execution of testing activities - to include both manual and automated testing.</p><p><b>Responsibilities</b></p><ul><li>Test products in an agile / lean product environment. Identify, track, and document software bugs and defects; Perform regression testing on updates and bug fixes</li></ul><ul><li>Use tools like WebDriver.io, Selenium, and Applitools to build automated tests for React.js &amp; Node.js products</li></ul><ul><li>Create comprehensive and scalable test plans for the complete development-to-release cycle</li></ul><ul><li>Actively contribute to designing, building, executing and maintaining automated test suites.</li></ul><ul><li>Facilitate testing across multiple devices and platforms using modern testing techniques</li></ul><ul><li>Raise strategic questions and insights that eliminate wasted work and raise the level of our teams</li></ul><ul><li>Contribute to a positive and collaborative work environment</li></ul><ul><li>Help us iterate on processes and guidelines</li></ul><ul><li>Promote a culture of continuous testing</li></ul>","requirement":"<p><b>Experience and Background</b></p><ul><li>Bachelor&#8217;s degree</li></ul><ul><li>3+ years of experience in software testing (QA)</li></ul><ul><li>2+ years of experience with automated testing tools - Selenium, WebDriver.io (or similar), Applitools</li></ul><ul><li>A sense of accountability and urgency in completing assignments</li></ul><ul><li>Self starter who is eager to provide innovative and new ideas</li></ul><ul><li>Experience working in a collaborative team environment</li></ul><ul><li>Be familiar with basic software and server architectural concepts</li></ul><p><b>Bonus</b></p><ul><li>Experience working in the real estate industry</li></ul><ul><li>Node and React experience</li></ul>"}
{"_id":{"$oid":"5daf4f546178d07c9e2090e5"},"is_remote":false,"job_type":0,"visa_sponsor":false,"salary_range":2,"is_published":true,"created_at":{"$date":"2019-10-22T18:49:00.164Z"},"title":"SWE Information Technology - Software Developer","company":"General Motors","location":"Austin, TX","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<span>The General Motors Information Technology is seeking to identify highly motivated and qualified individuals for potential future opportunities as Software Developer. In anticipation of these opportunities becoming available, if you are interested in learning more about GM, completing this profile will allow us to stay connected.</span><div><br></div><div><p>PLEASE ONLY APPLY IF YOU DO NOT NEED SPONSORSHIP TO WORK IN THE UNITED STATES NOW OR IN THE FUTURE. WE ARE UNABLE TO CONSIDER CANDIDATES WHO REQUIRE SPONSORSHIP.</p><p><b>Wanted: Software Developers who are innovators, creative minds, problem solvers, and people who get things done!</b></p><p></p><p><br></p><p>At General Motors, we&#8217;ve charged ourselves with one mission: to design, build and sell the world&#8217;s best vehicles. We have recently undergone one of the largest Information Technology transformations in the history of the automotive industry and continue to drive technology innovations within General Motors.</p><div><br>GM IT is a leader in cutting edge technologies such as Mobility, Telematics, Mission-Critical Business Systems, Supercomputing, Vehicle Engineering, and Real-time Computing. We offer challenging positions for passionate professionals looking to get in on the ground-floor of a growing &#8220;Fortune 5&#8221; firm that is re-inventing IT with a laser focus on Innovation, Speed, and Business Value.<br><br>We&#8217;re looking for Information Technology graduates who:<br><ul><li>Have an insatiable drive for excellence</li><li>Challenge themselves and their peers</li><li>Enjoy working collaboratively in a cross-functional teams</li><li>Demonstrate a strong work ethic</li><li>Have a strong ability and willingness to learn</li><li>Excel in a variety of job assignments</li><li>Understand physics and math concepts, and have the ability to apply them to real applications</li><li>Desire to deliver innovative solutions to complex problems</li></ul></div><p><br>Our roles require critical thinking, excellent communication, and a passion for service excellence. If you have what it takes, come join our team as a Software Developer!</p></div>","requirement":"<div><p>The&#160;<b>Software Developer</b>&#160;is responsible for developing solutions that drive innovation and competitive advantage. The role encompasses writing code to build and support GM&#8217;s systems, applications, and platforms as well as configuring, optimizing, and deploying packaged software (COTS). The role will interface with other project developers and architects to ensure that designs and quality are meeting GM requirements. Each Developer is envisioned to be part of the full SDLC of a project: from initiation through deployment.<br></p></div><p></p><div>Minimal Qualifications includes:</div><div></div><br><ul><li>Minimum 3.0/4.0 cumulative GPA</li><li>Recent college graduate with degree conferred, preferred December 2019 to June 2020</li><li>Experience with programming in Java, .NET or other languages</li><li>Knowledge of XML and relational databases (Oracle, SQL Server, MySQL)</li><li>Familiarity with packaged software (eg., SAP, PeopleSoft, Sharepoint, etc.)</li><li>Knowledge of the Software Development Lifecycle (SDLC) as well as software development methodologies (e.g. Agile, Scrum, Iterative, Waterfall, etc.)</li><li>Understanding of security, efficient code reuse, and software design</li></ul>"}
{"_id":{"$oid":"5daf4fcd6178d07c9e2090e6"},"is_remote":false,"job_type":0,"visa_sponsor":false,"salary_range":2,"is_published":true,"created_at":{"$date":"2019-10-22T18:49:00.164Z"},"title":"Software Engineer","company":"Volusion","location":"Austin, TX","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<span>At Volusion, we make products that people love. Our teams are dedicated to providing SaaS commerce solutions and services for all business types, ranging from startups to large enterprises. If you are the kind of entrepreneur that loves working in teams, has a passion for driving positive change, and wants to change the world with your ideas, we want to hear from you.</span><br><br><b>The rundown:</b><br><span>We are a customer-first company and we want all efforts and communications to represent this philosophy. Collaboration is an important facet of this. The Engineering team works and sits directly with the Product, Marketing and IT teams. A few examples of feature-adds/projects the team has recently worked on include:</span><br><br><ul><li>Site-builder using serverless infrastructure and React front-end</li><li>Inline content and style editing platform hosted in the cloud (GCP, Node.js)</li><li>Event tracking proxy that feeds our various marketing and sales systems (GCP, Kubernetes)</li><li>Modernization, automation and continuous deployment practices using tools such as Docker, CodeShip and CircleCI</li></ul><span>As a Software Engineer you will be expected to work with detailed technical requirements for a product or set of features and be able to cleanly implement that product or sets of features. You should have a decent computer science foundation in areas like formal logic, data structures and algorithms to name a few. You will report to one of our Software Engineer Manager's and be part of a team of Non-Senior to Senior Software Engineers.</span><br><br><b>Responsibilities include:</b><br><ul><li>Continuously deliver high-quality software using the latest proven frameworks, data storage, and open source technologies</li><li>Plan, design, develop, test, debug, and deploy highly-available ecommerce applications</li><li>Break down complex requirements into independent coding tasks and strategies</li><li>Actively looking for ways to make everything better</li><li>Experience working in modern agile and lean methodologies</li><li>Own your impact working with designers, peers, product managers and other departments to release features.</li><li>Be familiar with online SaaS subscription software</li><li>Brainstorm ideas and directly impact a well-defined business metric</li><li>Eager to help create the best tech company in Austin</li></ul>","requirement":"<b>We are looking for someone with:</b><br><ul><li>Bachelor's degree in Computer Science or similar</li><li>3+ years of proven software development experience</li><li>Experience with Node.js, React/Angular</li><li>Knowledge of services (mostly RESTful)</li><li>Google Cloud or AWS experience</li><li>Database knowledge; SQLServer, MongoDB or more modern no-sql store</li><li>Strong interest in learning and expanding your personal toolbox of skills</li><li>High emotional intelligence</li><li>A/B test mentality</li></ul><span>Who is also the embodiment of our culture code ( https://culture.volusion.com ) (we hope you are nodding your head in agreement as you browse through it!):</span><br><br><ul><li>Humble: Have humility and be respectful; no egos allowed.</li><li>Effective: Get stuff done!</li><li>Adaptable: Willing to fill any role, anytime. Going above/beyond the call of duty.</li><li>Transparent: Open and honest to self and others.</li><li>A founder: Think big, go fast, and solve for the customer.</li></ul><b>Benefits &amp; Perks:</b><br><ul><li>Competitive compensation packages</li><li>Medical, Dental, Vision, and Voluntary Life Insurance</li><li>Paid parental leave</li><li>Flexible Paid Time Off</li><li>401(k) with Company Matching</li><li>On-site Fitness and Yoga Classes</li><li>Casual Dress</li><li>Breakfast taco and beer Fridays</li><li>Endless Supply of Tiny House Nitro Coffee, Waterloo Sparking Water, fruit and snacks</li><li>Two Volunteer Days Off</li><li>Bring Your Dog to Work Days</li><li>Adjustable desks</li><li>Chair Massages</li><li>Team Sports and Team Outings</li></ul>"}
{"_id":{"$oid":"5daf50ad6178d07c9e2090e7"},"is_remote":true,"job_type":1,"visa_sponsor":false,"salary_range":3,"is_published":true,"created_at":{"$date":"2019-10-22T18:49:00.164Z"},"title":"Software Engineer","company":"Indeed","location":"USA","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<b>Our mission:</b><br><span>As the world&#8217;s number 1 job site, our mission is to help people get jobs. We need talented, passionate people working together to make this happen. We are looking to grow our teams with people who share our energy and enthusiasm for creating the best experience for job seekers.</span><br><br><b>The team:</b><br><span>We are a rapidly growing and highly capable engineering team building the most popular job site on the planet. Every month, over 250 million people count on us to help them find jobs, publish their resumes, process their job applications, and connect them to qualified candidates for their job openings. With engineering hubs in Seattle, San Francisco, Austin, Tokyo and Hyderabad, we are improving people's lives all around the world, one job at a time.</span><br><br><span>The base salary range below represents the low and high end of the Indeed salary range for this position. Actual salaries will vary and may be above or below the range based on various factors including but not limited to location, experience, and performance. The range listed is just one component of Indeed's total compensation package for employees. Other rewards include quarterly bonuses, Long Term Incentive Plan units, an open Paid Time Off policy, and many region-specific benefits.</span><br><br><b>Austin Base Salary Range:</b><br><b>Software Engineer I:</b><span>&#160;90,000 - 112,000 USD per year</span><br><b>Software Engineer II:</b><span>&#160;116,000 - 142,000 USD per year</span><br><b>Senior Software Engineer:</b><span>&#160;116,000 - 142,000 USD per year</span><br><b>Staff Software Engineer:</b><span>&#160;138,000 - 174,000 USD per year</span><br><b>Senior Staff Software Engineer:</b><span>&#160;172,000 - 218,000 USD per year</span><br><b>Principal Software Engineer:</b><span>&#160;199,000 - 261,000 USD per year</span><br><br><b>Your job:</b><br><span>If you are an engineer who's passionate about building innovative products that scale to tens of millions of page views a day, Indeed is looking for you. Indeed offers smart developers like you a complex development ecosystem with short release cycles. Every week sees the new release of multiple products that meet the growing needs of millions of jobseekers worldwide.</span><br><br><span>As as Software Engineer at Indeed, you&#8217;ll be working with a smart and diverse team of problem solvers who exhibit high energy, deep technical skills and a drive to get things done. We speak multiple languages working on various platforms: Java, Javascript, Python, Lucene, MySQL, MongoDB and many more.</span><br><br><span>Indeed&#8217;s job search engine serves billions of search queries every month connecting tens of millions of jobseekers to relevant job opportunities. As part of a small collaborative team from engineering, operations and product management, you will work on areas such as feature extraction, document indexing, retrieval, and relevancy scoring. We constantly dig into the data available at Indeed to analyze, inform and develop solutions to the right problems. If looking at data, slicing and dicing it in multiple ways and coming up with interesting insights is something you thrive upon, you will fit right in.</span>","requirement":"<b>About you:</b><br><span>Requirements</span><br><br><ul><li>BS in Computer Science or related area, or relevant work experience</li><li>Minimum 3 years experience in software development with at least one of the following languages: Java, C++, Python, Go</li><li>Strong understanding of algorithms, data structures and statistics</li><li>Strong knowledge of operating system behaviors, especially regarding stability, performance, and correctness</li><li>Experience with distributed data stores like Dynamo, Cassandra, HDFS, and ZooKeeper</li><li>Experience with service-oriented architectures</li></ul><b>We get excited about candidates who have:</b><br><ul><li>Expertise in clustering and classification techniques preferred</li><li>Experience building solutions for high traffic web sites a plus</li><li>Real-world, experience with one or more of the following, at scale: MySQL, Hadoop (CDH5), ElasticSearch, RabbitMQ</li><li>Thrive in a highly collaborative, cross-functional environment</li></ul><span>Indeed provides a variety of benefits that help us focus on our mission of helping people get jobs.</span><br>"}
{"_id":{"$oid":"5daf51146178d07c9e2090e8"},"is_remote":true,"job_type":0,"visa_sponsor":false,"salary_range":3,"is_published":true,"created_at":{"$date":"2019-10-22T18:49:00.164Z"},"title":"Software Engineer","company":"Megger - Baker Instruments","location":"Fort Collins, CO","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0,"description":"<p><b>Typical Project Responsibilities:</b></p><ul><li>Collaboratively prioritizing requirements with Customers, Sales, Marketing, Service and Manufacturing</li></ul><ul><li>Determining the architecture and detailed design approach</li><li>Documenting project requirements</li><li>Executing and reviewing designs</li><li>Developing test plans and procedures for the project, ensuring they are executed correctly and any deviations are addressed</li><li>When applicable, understand present code base and product use model</li><li>Other duties as assigned</li></ul>","requirement":"<p><b>Required Skills:</b></p><ul><li>Solid understanding of software algorithms and data structures</li><li>Object oriented design skills including object design and responsibility assignment, low coupling and high cohesion, and polymorphism</li><li>Demonstrated skills in C/C++ and Java or C#</li></ul><p><b>Highly Desired Skills:</b></p><ul><li>Experience in mobile development using Android Studio</li><li>Mobile UI development skills</li><li>Experience with both Java and C threading</li></ul><p><b>Desired Skills:</b></p><ul><li>Experience using a Realm object database in a mobile environment</li><li>Experience using SciChart for creating charts and graphs in a mobile environment</li><li>Experience developing in C in a Linux environment</li><li>Experience developing for an embedded system</li><li>Experience using JNI to interface between native C libraries and managed Java to provide low level support to Java applications</li></ul><p><b>Experience and Qualifications:</b></p><ul><li>Bachelors or Masters degree in Computer Science, or equivalent experience</li><li>2-5 years&#8217; experience in a software engineering role</li><li>Experience in engineering of products consisting or electronic, software, and mechanical content, with history of meeting schedule, scope and budgets.</li></ul><p><b>Additional Knowledge/Skills/Abilities:</b></p><ul><li>Technical expertise and the knowledge to apply technology effectively</li><li>Is a self-starter &#8211; takes initiative to make things happen</li><li>Continually improves self, product, process and team</li><li>Innovates in the areas of product concepts, project content and technology application</li><li>Satisfies customers, both internal and external</li><li>Demonstrates high level of professional integrity</li></ul>"}
{"_id":{"$oid":"5daf51886178d07c9e2090e9"},"is_remote":true,"job_type":0,"visa_sponsor":true,"salary_range":3,"is_published":true,"created_at":{"$date":"2019-10-22T18:49:00.164Z"},"title":"Software Engineer (C++)","company":"BodyViz","location":"Des Moines, IA","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"__v":0}
{"_id":{"$oid":"5daf5208e03ebd7cccf4edcb"},"is_remote":true,"job_type":0,"visa_sponsor":true,"salary_range":3,"is_published":true,"title":"Software Engineer/Web Developer","company":"BitBuild","location":"Lehi, UT","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"created_at":{"$date":"2019-10-22T19:01:28.36Z"},"__v":0,"description":"<p>We're looking to hire a few talented engineers. You'll enjoy a great atmosphere with smart associates and great projects. You'll be challenged, but will have the autonomy to focus on producing great work and have your voice heard on crafting elegant solutions to interesting problems. You'll be happy as you work at a reasonable pace with management that understands the rigors and intricacies of getting things done right! Learn more about us at https://bitbuild.com.</p><p><b>Compensation:</b></p><ul><li>Great salary (total compensation depends on experience)</li><li>Full benefits</li><li>Awesome perks!</li></ul>","requirement":"<p><b>We would love it if you have:</b></p><ul><li>BA/BS in related field or equivalent experience</li><li>5-10 years of web development and programming experience</li><li>Experience with React</li><li>Experience working with popular web technologies, frameworks and languages</li><li>Experience with agile development a plus</li><li>Experience with test-driven development a plus</li><li>Working experience &amp; understanding of latest CSS and HTML5</li><li>JavaScript expertise &amp; experience with Angular or jQuery or other libraries/frameworks</li></ul><p>Contact us today to schedule a phone interview!</p>"}
{"_id":{"$oid":"5daf5266e03ebd7cccf4edcc"},"is_remote":true,"job_type":0,"visa_sponsor":true,"salary_range":2,"is_published":true,"title":"Software Engineer | PL/SQL","company":"Lifeway Christian Resources","location":"Nashville, TN","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"created_at":{"$date":"2019-10-22T19:03:02.353Z"},"__v":0,"description":"<h2 class=\"jobSectionHeader\"><b>Overview<br></b></h2><div></div><div><div><div><div><b>Why work with LifeWay IT (</b><b>tech.lifeway.com</b><b>)?</b>&#160;LifeWay is one of the world&#8217;s largest providers of Christian resources, and we are expanding our global footprint having recently incorporated in India and Mexico. As one of 2018 Forbes Best Midsize Employers and Best Employers for Women and one of the largest IT teams in Nashville, LifeWay IT is as innovative with technology solutions as we are with employee work-life balance, work environment, and culture. This position offers remote work options, a casual work environment, flexible hours, and 10% self-development time every week.&#160;<b>This position may be based remotely in the U.S. or in Nashville, TN. Relocation assistance may be provided.</b></div><div></div><br><div>We are looking for a&#160;<b>Software Engineer - PL/SQL&#160;</b>who will be involved in development projects to streamline and enhance internal applications. It will include all facets of development from requirements analysis, to design, development and implementation. Individual may interface with multiple levels of management both with the product development team as well as the IT development and architecture teams.</div></div></div></div><h2 class=\"jobSectionHeader\"><b>Responsibilities</b></h2><div><div><div><ul><li>Provides application development, integrations and/or support, including independently performing problem identification and resolution.</li><li>Follows and executes established development and support processes.</li><li>Collaborates with business partners to troubleshoots system related issues and gather requirements for technical solutions.</li><li>Performs intermediate configuration, implementation and upgrades of existing systems with minimal supervision.</li><li>Provides support and input to projects, including task planning and execution.</li><li>Works independently on projects that may span multiple functional areas.</li><li>Identifies and works to automate tasks and processes with scripting, ETL tools, and automation tools.</li><li>Meets the quality standards set forth by management.</li><li>Ensures availability when necessary for off-shift and weekend support functions.</li><li>Incorporates enterprise security standards into functional area</li><li>Participates in accomplishment of continuous improvement objectives for the department.</li><li>Participates in the identification of problem areas and development of resolutions to address them.</li><li>Assist in developing project plans, leading meetings and other related tasks to gather and coordinate activities for requirements gathering.</li></ul></div></div></div>","requirement":"<h2 class=\"jobSectionHeader\"><b>Qualifications</b></h2><div><div><div><ul><li>Bachelor's degree in computer science, information technology, or related degree</li><li>3-5 years of experience with Database Programming using Oracle, PL/SQL, SQL, Unix scripting, writing and composing complex queries using efficient coding practices, functions, views, tables, and stored procedures</li><li>3+ years of application support including order management, inventory management, sales tax, Customer - TCA modules, credit card/PCI compliance</li><li>Working knowledge of and ability to independently apply one or more programming and/or scripting languages (e.g. PL/SQL, SQL, XML Publisher, OAF Framework, Java, Unix scripting, Talend, etc.)</li><li>Working knowledge of a tasking tool such as JIRA</li><li>Agile development methodology</li><li>Advanced written and verbal communication skills</li><li>Advanced analytical and problem solving skills</li><li>Demonstrated ability and willingness to learn new technologies</li><li>Demonstrated ability to gain a general understanding of core business procedures and operations</li><li>Demonstrated ability to troubleshoot and recommend process changes that improve the overall implementation, maintenance and support of applications</li><li>Working knowledge of Oracle EBS preferred</li></ul></div></div></div>"}
{"_id":{"$oid":"5daf5585b607987dacef5f19"},"is_remote":false,"job_type":0,"visa_sponsor":true,"salary_range":2,"is_published":true,"title":"Software Development Engineer in Test","company":"Virgin Pulse","location":"Framingham, MA","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"created_at":{"$date":"2019-10-22T19:16:21.712Z"},"__v":0,"description":"<p>You are a talented, motivated&#160;<b>Software&#160;</b><b>Development Engineer</b><b>&#160;in Test</b>&#160;(SDET) who is capable of performing testing and quality assurance for our growing engineering team. You will be responsible for creating and implementing automation tests to ensure quality and expected functionality. You seek to work with others to best understand business requirements in order to develop corresponding test plans, test cases and test data, as well as execute manual testing scenarios when appropriate. Focus, enthusiasm, a dedication to excellence and constant desire to learn are all personal characteristics you possess which are highly valued in the VP organization.</p><div><b>In order to represent the best of what we have to offer you come to us with a multitude of abilities in order to&#160;</b><b>successfully contribute to the team.&#160;</b><b>You are able to skillfully:</b><b></b></div><ul><li>Develop new automation tests and contribute to continuous delivery</li></ul><ul><li>Develop and maintain a current and thorough understanding of existing RedBrick Health system design, architecture, and business logic.</li><li>Work with affected Business and user areas to develop and document detailed test suites using our behavior driven development model.</li><li>Provide project management with software testing effort estimates for project planning and scheduling purposes.</li><li>Thoroughly analyze test execution results to ensure that the work products comply with approved design and documented requirements.</li><li>Report all defects discovered using defined defect reporting processes.</li><li>Actively participates in requirements and design reviews, release readiness reviews and other inspections.</li><li>Participate in the coordination and monitoring of software development activities including all related meetings, walkthroughs, technical reviews, testing, and problem resolution.</li><li>Assist in the gathering and analyzing of testing metrics and suggests process improvements to improve the software development and testing processes including performance testing and monitoring.</li><li>Prioritize and delegate projects and tasks as needed.</li><li>Coordinate with business stakeholders and escalate issues as needed.</li><li>Provide ongoing process improvement and efficiency metrics for the department.</li><li>Be adaptable enough to work on whatever is necessary to finish tasks</li></ul>","requirement":"<p><b>What you bring to the team.</b></p><ul><li>Bachelor of Science degree in Computer Science, Software Engineering, or Management Information Systems, or equivalent technology experience.</li><li>3 years of SDET/CI/CD/Automation experience</li><li>Experience using automation testing tools and techniques.</li><li>Experience with formal testing processes.</li><li>Test case and test scenario writing; both manual and automation.</li><li>Experience working with scripting languages and APIs</li><li>Knowledge of services, web technologies and n-tier browser-based applications.</li><li>Experience with and thorough understanding of formal defect management processes.</li><li>Demonstrated expertise troubleshooting complex, distributed software applications.</li><li>Ability to work well with other teams to resolve issues and defects.</li><li>Excellent communication and interpersonal skills.</li><li>Show an ability to learn and solve issues in a timely manner.</li></ul>"}
{"_id":{"$oid":"5daf5620b607987dacef5f1a"},"is_remote":false,"job_type":0,"visa_sponsor":false,"salary_range":2,"is_published":true,"title":"Software Engineer (Java)","company":"E*TRADE Financial","location":"Chicago, IL","user_id":{"$oid":"5daa757dc0a6330a10d48d2a"},"created_at":{"$date":"2019-10-22T19:18:56.006Z"},"__v":0,"description":"<h2 class=\"jobSectionHeader\"><b>About the Role<br></b></h2><div></div><div><div><div><div><b>SUMMARY</b><br><br>The Staff, Software Engineering is viewed as a mid-level developer in applications development who can work on the complex projects requiring specialized technical knowledge. They are able to work with the technical leads to solve complex application development tasks. They additionally coordinate with users to determine requirements and ensure that system improvements are successfully implemented and monitored to increase efficiency.<br><br><b>RESPONSIBILITIES</b></div><ul><li>Design and develop Java based applications.</li><li>Codes, tests, debugs, documents and implements complex software applications.</li><li>Creates prototypes.</li><li>Interface with product team to gather requirements. Escalate and communicate issues to manager.</li><li>Resolve issues that other junior team members are unable to solve.</li><li>Provide technical solutions to problems encountered in the team.</li><li>Review the work done by other team members to make sure it adheres to the standards.</li><li>Makes well-thought-out decisions on complex or ambiguous application development issues.</li><li>Coordinates with users to determine requirements.</li><li>Ensures that system improvements are successfully implemented and monitored to increase efficiency.</li></ul></div></div></div>","requirement":"<h2 class=\"jobSectionHeader\"><b>Qualifications<br></b></h2><div></div><div><div><div><div><b>Basic</b></div><ul><li>Bachelor&#8217;s degree in Computer Science/Computer Engineering/Computer Information Systems is required.</li><li>2-4 years minimum as a software developer</li></ul><div><br><b>Preferred</b></div><ul><li>Java, Spring, ORM, OOD</li><li>Strong technical and business communication skills</li><li>Strong Linux/UNIX background</li><li>Strong Shell scripting</li><li>ESQL/DB (Sybase, Oracle) skills</li><li>Service Oriented Architecture</li><li>Experience working with market data systems is preferred</li><li>Experience working with streaming data systems is preferred</li></ul></div></div></div>"}
